
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.org_domain_restricted_sharing.data.google_organization.orgs["deepbreathe.ai"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_organization" "orgs" {
      + create_time           = (known after apply)
      + directory_customer_id = (known after apply)
      + domain                = "deepbreathe.ai"
      + id                    = (known after apply)
      + lifecycle_state       = (known after apply)
      + name                  = (known after apply)
      + org_id                = (known after apply)
    }

  # module.common_kms.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-kms-bz2d"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.common_kms.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/5f3fd392-3e8e-4c35-b805-2e3ec498fe65"
        name            = "5f3fd392-3e8e-4c35-b805-2e3ec498fe65"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/464383692293",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_kms.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-c-kms-bz2d"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-c-kms"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.interconnect.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-net-interconnect-xnf8"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.interconnect.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/c8ee8a6d-0641-48ec-87bd-4838547e9daf"
        name            = "c8ee8a6d-0641-48ec-87bd-4838547e9daf"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/416794030907",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.interconnect.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-net-interconnect-xnf8"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-net-interconnect"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.org_audit_logs.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-logging-x8hi"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.org_audit_logs.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/5f237a88-ef5f-48e5-8aa6-e9e5e2f6e334"
        name            = "5f237a88-ef5f-48e5-8aa6-e9e5e2f6e334"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/472329463640",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_audit_logs.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben-deepbreathe-ai"
          ~ "secondary_contact" = "example2" -> "khoa-deepbreathe-ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-c-logging-x8hi"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben-deepbreathe-ai"
          ~ "secondary_contact" = "example2" -> "khoa-deepbreathe-ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-c-logging"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben-deepbreathe-ai"
          ~ "secondary_contact" = "example2" -> "khoa-deepbreathe-ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.org_billing_export.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-billing-export-rv7q"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.org_billing_export.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/ce455e28-1495-4f8c-b118-f5a3ac785d2d"
        name            = "ce455e28-1495-4f8c-b118-f5a3ac785d2d"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/31633220442",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_billing_export.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-c-billing-export-rv7q"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-c-billing-export"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.org_domain_restricted_sharing.module.allowed-policy-member-domains.google_organization_policy.org_policy_list_allow_values[0] will be updated in-place
  ~ resource "google_organization_policy" "org_policy_list_allow_values" {
        id          = "1003456002475/constraints/iam.allowedPolicyMemberDomains"
        # (5 unchanged attributes hidden)

      ~ list_policy {
            # (1 unchanged attribute hidden)

          ~ allow {
              ~ values = [
                  - "C01o6l7fx",
                ] -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.org_secrets.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-secrets-rh08"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.org_secrets.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/32ec11c6-595d-42fd-9134-4b06715a5f4c"
        name            = "32ec11c6-595d-42fd-9134-4b06715a5f4c"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/420532158488",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_secrets.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-c-secrets-rh08"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-c-secrets"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.scc_notifications.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-scc-d8ld"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.scc_notifications.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/0102AD-2D118D-FFFFD8/budgets/fd75cad0-2464-4d30-bb16-79af01f33504"
        name            = "fd75cad0-2464-4d30-bb16-79af01f33504"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/907195684942",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.scc_notifications.module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ effective_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        id                  = "projects/prj-c-scc-d8ld"
      ~ labels              = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        name                = "prj-c-scc"
      ~ terraform_labels    = {
          ~ "billing_code"      = "1234" -> "db-infra"
          ~ "primary_contact"   = "example1" -> "ben@deepbreathe.ai"
          ~ "secondary_contact" = "example2" -> "khoa@deepbreathe.ai"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 13 to change, 0 to destroy.

  ```

  </details>
  
  